In [1]:
import numpy as np
import pandas as pd

In [5]:
out_ind = ['T1', 'T1', 'T1','T2', 'T2', 'T2']
ins_ind = [1, 2, 3, 1, 2, 3]
ind_hier = list(zip(out_ind, ins_ind))

In [6]:
ind_hier

[('T1', 1), ('T1', 2), ('T1', 3), ('T2', 1), ('T2', 2), ('T2', 3)]

In [11]:
mult_ind = pd.MultiIndex(levels=[['T1', 'T2'], [1, 2, 3]], 
                      codes =[[0, 0, 0, 1, 1, 1], [0, 1, 2, 0, 1, 2]])

In [15]:
mult_ind_df = pd.DataFrame(np.random.randn(6, 2), mult_ind, ['X', 'Y'])

In [17]:
 mult_ind_df

             X         Y
T1 1 -1.227803 -1.442002
   2 -0.592503  1.061701
   3 -0.309857  2.008944
T2 1 -1.037093  0.882849
   2 -1.870835  0.577522
   3  0.238623  0.792160

In [19]:
mult_ind_df.loc['T1'].loc[2]

X   -0.592503
Y    1.061701
Name: 2, dtype: float64

In [20]:
mult_ind_df

             X         Y
T1 1 -1.227803 -1.442002
   2 -0.592503  1.061701
   3 -0.309857  2.008944
T2 1 -1.037093  0.882849
   2 -1.870835  0.577522
   3  0.238623  0.792160

In [21]:
mult_ind_df.index.names

FrozenList([None, None])

In [22]:
mult_ind_df.index.names = ['Types', 'Numbers']

In [23]:
mult_ind_df

                      X         Y
Types Numbers
T1    1       -1.227803 -1.442002
      2       -0.592503  1.061701
      3       -0.309857  2.008944
T2    1       -1.037093  0.882849
      2       -1.870835  0.577522
      3        0.238623  0.792160

In [27]:
mult_ind_df.loc['T1'].loc[3]['Y']

2.008944023565996

In [28]:
mult_ind_df

                      X         Y
Types Numbers
T1    1       -1.227803 -1.442002
      2       -0.592503  1.061701
      3       -0.309857  2.008944
T2    1       -1.037093  0.882849
      2       -1.870835  0.577522
      3        0.238623  0.792160

In [29]:
mult_ind_df.loc['T2']

                X         Y
Numbers
1       -1.037093  0.882849
2       -1.870835  0.577522
3        0.238623  0.792160

In [30]:
mult_ind_df.xs('T2')

                X         Y
Numbers
1       -1.037093  0.882849
2       -1.870835  0.577522
3        0.238623  0.792160

In [31]:
mult_ind_df

                      X         Y
Types Numbers
T1    1       -1.227803 -1.442002
      2       -0.592503  1.061701
      3       -0.309857  2.008944
T2    1       -1.037093  0.882849
      2       -1.870835  0.577522
      3        0.238623  0.792160

In [32]:
mult_ind_df.xs(2, level='Numbers')

              X         Y
Types
T1    -0.592503  1.061701
T2    -1.870835  0.577522